## R Code Using sqldf

In [1]:
library(sqldf)
library(babynames)

Loading required package: gsubfn
Loading required package: proto
Loading required package: RSQLite

In [2]:
head(babynames)
str(babynames)

  year sex name      n    prop
1 1880 F   Mary      7065 0.07238433
2 1880 F   Anna      2604 0.02667923
3 1880 F   Emma      2003 0.02052170
4 1880 F   Elizabeth 1939 0.01986599
5 1880 F   Minnie    1746 0.01788861
6 1880 F   Margaret  1578 0.01616737

Classes 'tbl_df', 'tbl' and 'data.frame':	1858689 obs. of  5 variables:
 $ year: num  1880 1880 1880 1880 1880 1880 1880 1880 1880 1880 ...
 $ sex : chr  "F" "F" "F" "F" ...
 $ name: chr  "Mary" "Anna" "Emma" "Elizabeth" ...
 $ n   : int  7065 2604 2003 1939 1746 1578 1472 1414 1320 1288 ...
 $ prop: num  0.0724 0.0267 0.0205 0.0199 0.0179 ...

In [3]:
sqldf("select name, sum(n) as NameCount
       from babynames 
       where year > 2000
       Group By name limit 10")

   name      NameCount
1  Aaban       87
2  Aabha       28
3  Aabid        5
4  Aabriella   15
5  Aada         5
6  Aadam      160
7  Aadan      122
8  Aadarsh    168
9  Aaden     4218
10 Aadesh      15

In [4]:
ref_sex <- data.frame(sex_code = c('F', 'M'), sex_desc = c('Female', 'Male'))

sqldf("select * 
      from babynames 
      join ref_sex 
      on (babynames.sex = ref_sex.sex_code)
      where year > 2000 limit 10")

   year sex name      n     prop        sex_code sex_desc
1  2001 F   Emily     25052 0.012655267 F        Female
2  2001 F   Madison   22158 0.011193334 F        Female
3  2001 F   Hannah    20707 0.010460347 F        Female
4  2001 F   Ashley    16524 0.008347263 F        Female
5  2001 F   Alexis    16396 0.008282603 F        Female
6  2001 F   Sarah     15889 0.008026487 F        Female
7  2001 F   Samantha  15860 0.008011837 F        Female
8  2001 F   Abigail   14803 0.007477883 F        Female
9  2001 F   Elizabeth 14783 0.007467780 F        Female
10 2001 F   Olivia    13975 0.007059610 F        Female